import { z } from "zod";

const trainingSchema = z.object({
  /** An id for the training */
  id: z.number(),

  /** A background color for the section. It has to be in the format #HEX */
  backgroundColor: z.string().regex(/^#?([0-9A-Fa-f]{3}|[0-9A-Fa-f]{6})$/),

  /** What is learnt with the training. */
  whatWeLearn: z.string(),

  /** For whom is the training intended. Each group should be listed in a separate object in an array.
   *
   * For example:
   *
   * [{id: 1, description: "Регистрирани членови во извидничката организација, на возраст над 14 години."}]
   */
  forWhom: z.array(z.object({ id: z.number(), description: z.string() })),

  /** How can the skills be acquired. Each skill should be listed in a separate object in an array.
   *
   * For example:
   *
   * [{id: 1, description: "Со активно учество на ШЗВ 1"}]
   */
  howItIsAcquired: z.array(
    z.object({ id: z.number(), description: z.string() })
  ),

  /** Type of training, e.g. Обука за обучувачи. */
  typeOfTraining: z.string(),

  /** Image for the type of training. It should be provided as svg. */
  typeOfTrainingImageSrc: z.string().regex(/^.+\.(svg|png)$/),
});

const trainingArraySchema = z.array(trainingSchema);

export type TrainingSchema = z.infer<typeof trainingSchema>;

export type TrainingArraySchema = z.infer<typeof trainingArraySchema>;

const trainingData = [
  {
    id: 1,
    backgroundColor: "#455227",
    whatWeLearn:
      "Прогресивната патека за личен развој во извидничкото движење започнува токму со оваа школа. Истата опфаќа теоретска едукација и развој на лидерски вештини кај секој учесник, основни меки вештини, имплементирање на веќе постоечки програми за деца и млади од основната програма на СИМ и вештини за промоција на извидништвото и извидничките вредности. Накратко, се имплементира курикулум создаден од комбинација на меки вештини, лидерски вештини и основни извиднички вештини.",
    forWhom: [
      {
        id: 1,
        description:
          "Регистрирани членови во извидничката организација, на возраст над 14 години.",
      },
    ],
    howItIsAcquired: [
      { id: 1, description: "Со активно учество на ШЗВ 1" },
      {
        id: 2,
        description:
          "Со планирање и имплементација на сесија / работилница во рамките на Летен / Зимски Камп, Ден на извидници, Извиднички караван.",
      },
    ],
    typeOfTraining: "школа за водачи 1",
    typeOfTrainingImageSrc: "/img/obuka-page/poligon.svg",
  },
  {
    id: 2,
    backgroundColor: "#330428",
    whatWeLearn:
      "Следната етапа во патеката за личен развој претставува Школата за водачи 2 на која предуслов за учество е поминат првиот степен на едукација - ШЗВ 1. Со оваа школа членовите на извидничката организација имаат можност за практикување на вештини за имплементирање на програми, работење врз база на менторство и добиен фидбек и развивање на нови активности врз база на поставените едукативни цели. Дополнително се работи на вештини за имплементирање на дополнителни програми како целите за оддржлив развој, Earth Tribe иницијатива, идентификување и имплементирање на локални инцијативи, извори за основно финансирање и активности за промоција на извидништвото преку отворени настани - каравани, промотивни настани, настани во училишта итн. Накратко, се имплементира курикулум создаден од комбинација на вештини за проектен менаџмент, обезбедување на ресурси на одржлив начин, вештини за пласирање на пазарот на трудот и сл.",
    forWhom: [
      {
        id: 1,
        description:
          "Регистрирани членови во извидничката организација, на возраст над 16 години, со веќе помината и освоена Школа за водачи 1.",
      },
    ],
    howItIsAcquired: [
      { id: 1, description: "Со активно учество на ШЗВ 1" },
      {
        id: 2,
        description:
          "Со планирање и имплементација на Летен / Зимски Камп, Извидничка Лига, Локална одредска акција.",
      },
    ],
    typeOfTraining: "обука за лидери 2",
    typeOfTrainingImageSrc: "/img/obuka-page/obuka-second.svg",
  },
  {
    id: 3,
    backgroundColor: "#B94514",
    whatWeLearn:
      "Овој тренинг претставува можност младите да ги развијат и доразвијат своите тренерски вештини. Преку овој тренинг младите стекнуваат вештини за давање на конструктивен фидбек, изучуваат тренинг методи и најразлични тренинг помагала, се стекнуваат со презентациски вештини, како и вештини за планирање и имплементација на тренинг. Во оваа етапа не се изоставени ни методите за ефикасно искуствено учење, како и истражување на начините на кои учат различните возрасни категории на публиката. Тренингот за тренери е наменет за стекнување на вештини за фасилитирање и организирање на тренинзи согласно извидничкиот метод на работа.",
    forWhom: [
      {
        id: 1,
        description:
          "Регистрирани членови во извидничката организација, на возраст над 18 години, со веќе поминати и освоени Школа за водачи 1 и Школа за Водачи 2.",
      },
    ],
    howItIsAcquired: [
      { id: 1, description: "Со активно учество на Тренинг за тренери" },
      {
        id: 2,
        description:
          "Со планирање и имплементација на работилница / сесија за Школа за водачи 1 или Школа за водачи 2.",
      },
    ],
    typeOfTraining: "обука за обучувачи",
    typeOfTrainingImageSrc: "/img/obuka-page/obuka-three.svg",
  },
  {
    id: 4,
    backgroundColor: "#533628",
    whatWeLearn:
      "Последниот стадиум на патеката за личен развој е оваа школа, која се имплементира според светскиот WoodBadge метод на едукација практикуван во сите национални извиднички организации / сојузи - членки во Светската Извидничка Организација. Инструкторската школа цели кон стекнување на напредни лидерски вештини, зајакнување на организациските вештини кај еден поединец, како и стекнување напредни вештини за проектно пишување и проектен менаџмент, мониторинг и евалуација. Со завршувањето на оваа школа, младите се подготвени да се впуштат во посериозни обврски и позиции во работата на една организација на национално или локално ниво, а дополнително и да работат на развивање на вештините на останатите млади во и вон организацијата. Програмата е базирана на WoodBadge компетенциите на светската извидничка организација препознаена од 174 држави во светот.",
    forWhom: [
      {
        id: 1,
        description:
          "Регистрирани членови во извидничката организација, на возраст над 21 година, со веќе поминати и освоени Школа за водачи 1, Школа за Водачи 2 и Тренинг за Тренери.",
      },
    ],
    howItIsAcquired: [
      {
        id: 1,
        description:
          "Со активно учество и помината теоретска и практична настава на Инструкторска школа;",
      },
      {
        id: 2,
        description: "Со спроведен инструкторски проект на национално ниво.",
      },
    ],
    typeOfTraining: "обука за инструктори",
    typeOfTrainingImageSrc: "/img/obuka-page/obuka-four.png",
  },
];

function parseTrainingData() {
  const trainingDataParsed = trainingArraySchema.safeParse(trainingData);

  if (!trainingDataParsed.success) {
    throw new Error(trainingDataParsed.error.message);
  }

  return trainingDataParsed.data;
}

const trainingDataParsed = parseTrainingData();

export default trainingDataParsed;
